brew "atuin"
brew "bitwarden-cli"
brew "bun"
brew "chezmoi"
brew "cmake"
brew "direnv"
brew "keychain"
brew "neovim"
brew "pinentry"
brew "shellcheck"
brew "vim"

cask "1password"
cask "adobe-acrobat-reader"
cask "aerospace"
cask "balenaetcher"
cask "bambu-studio"
cask "claude"
cask "codex"
cask "dot"
cask "dropbox"
cask "freecad"
cask "ghostty"
cask "gimp"
cask "iterm2"
cask "obs"
cask "obsidian"
cask "raycast"
cask "tailscale-app"
cask "zed"
cask "zen"
cask "zen-browser"
cask "zotero"
